In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('people-example.csv')

In [3]:
df

  First Name Last Name        Country  age
0        Bob     Smith  United States   24
1      Alice  Williams         Canada   23
2    Malcolm      Jone        England   22
3      Felix     Brown            USA   23
4       Alex    Cooper         Poland   23
5        Tod  Campbell  United States   22
6      Derek      Ward    Switzerland   25

In [4]:
df.tail(1)

  First Name Last Name      Country  age
6      Derek      Ward  Switzerland   25

In [5]:
import matplotlib as plt

In [6]:
df['age']

0    24
1    23
2    22
3    23
4    23
5    22
6    25
Name: age, dtype: int64

In [7]:
df.Country

0    United States
1           Canada
2          England
3              USA
4           Poland
5    United States
6      Switzerland
Name: Country, dtype: object

In [8]:
df.age.mean()

23.142857142857142

In [9]:
df.age.max()

25

In [10]:
df['Full Name'] = df['First Name'] + ' ' + df['Last Name']

In [11]:
df

  First Name Last Name        Country  age       Full Name
0        Bob     Smith  United States   24       Bob Smith
1      Alice  Williams         Canada   23  Alice Williams
2    Malcolm      Jone        England   22    Malcolm Jone
3      Felix     Brown            USA   23     Felix Brown
4       Alex    Cooper         Poland   23     Alex Cooper
5        Tod  Campbell  United States   22    Tod Campbell
6      Derek      Ward    Switzerland   25      Derek Ward

In [12]:
transform_country = lambda c : 'United States' if c == 'USA' else c

In [13]:
transform_country('Brazil')

'Brazil'

In [14]:
transform_country('USA')

'United States'

In [15]:
df.Country = df.Country.apply(transform_country)

In [16]:
df

  First Name Last Name        Country  age       Full Name
0        Bob     Smith  United States   24       Bob Smith
1      Alice  Williams         Canada   23  Alice Williams
2    Malcolm      Jone        England   22    Malcolm Jone
3      Felix     Brown  United States   23     Felix Brown
4       Alex    Cooper         Poland   23     Alex Cooper
5        Tod  Campbell  United States   22    Tod Campbell
6      Derek      Ward    Switzerland   25      Derek Ward

In [29]:
ageGroup = df.age

In [30]:
ageGroup

0    24
1    23
2    22
3    23
4    23
5    22
6    25
Name: age, dtype: int64